apply_case/constant/board/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/board/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


2
(
    board_to_soc
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          68;
        startFace       7285;
        sampleMode      nearestPatchFace;
        sampleRegion    soc;
        samplePatch     soc_to_board;
    }

    board_to_air
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          2598;
        startFace       7353;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_board;
    }

)


// ************************************************************************* //
